{
  "skull": {
    "name": "กระดูกกะโหลกศีรษะ (Skull)",
    "description": "กระดูกที่ห่อหุ้มและปกป้องสมอง ประกอบด้วย 22 ชิ้น แบ่งเป็นกระดูกส่วนกะโหลก (Cranium) 8 ชิ้น และกระดูกใบหน้า (Facial bones) 14 ชิ้น ทำหน้าที่ปกป้องสมองและอวัยวะรับความรู้สึกบริเวณศีรษะ",
    "color": "#ff6b6b"
  },
  "frontal": {
    "name": "กระดูกหน้าผาก (Frontal Bone)",
    "description": "กระดูกด้านหน้าของกะโหลกศีรษะ ครอบคลุมหน้าผากและส่วนบนของเบ้าตา ทำหน้าที่ปกป้องส่วนหน้าของสมองและเป็นส่วนหนึ่งของโพรงไซนัส",
    "color": "#ff6b6b"
  },
  "parietal": {
    "name": "กระดูกข้างขม่อม (Parietal Bones)",
    "description": "กระดูก 2 ชิ้นที่อยู่ด้านข้างและด้านบนของกะโหลก เชื่อมกันตรงกลางด้วยรอยต่อกะโหลก ทำหน้าที่ปกป้องส่วนบนและข้างของสมอง",
    "color": "#ff6b6b"
  },
  "temporal": {
    "name": "กระดูกขมับ (Temporal Bones)",
    "description": "กระดูก 2 ชิ้นที่อยู่ด้านข้างของกะโหลก บริเวณขมับ มีช่องหูอยู่ภายใน ทำหน้าที่ปกป้องหูชั้นในและกลางและเป็นที่ยึดของกล้ามเนื้อที่ใช้ในการเคี้ยว",
    "color": "#ff6b6b"
  },
  "occipital": {
    "name": "กระดูกท้ายทอย (Occipital Bone)",
    "description": "กระดูกด้านหลังและฐานของกะโหลกศีรษะ มีรูใหญ่ (Foramen Magnum) เพื่อให้ไขสันหลังผ่านเข้าสู่กะโหลก ทำหน้าที่ปกป้องส่วนหลังของสมองและเชื่อมกับกระดูกสันหลังส่วนคอ",
    "color": "#ff6b6b"
  },
  "sphenoid": {
    "name": "กระดูกรูปปีกค้างคาว (Sphenoid Bone)",
    "description": "กระดูกที่อยู่ตรงกลางฐานกะโหลกศีรษะ รูปร่างคล้ายปีกค้างคาว เป็นจุดเชื่อมต่อของกระดูกกะโหลกหลายชิ้น มีต่อมใต้สมองอยู่ในโพรงที่เรียกว่า Sella Turcica",
    "color": "#ff6b6b"
  },
  "ethmoid": {
    "name": "กระดูกตะแกรงจมูก (Ethmoid Bone)",
    "description": "กระดูกเบาบางที่อยู่ระหว่างจมูกกับกะโหลกสมอง มีรูพรุนเหมือนฟองน้ำ ทำหน้าที่เป็นส่วนหนึ่งของโพรงจมูกและเบ้าตา ช่วยในการกรองและให้ความอบอุ่นแก่อากาศ",
    "color": "#ff6b6b"
  },
  "nasal": {
    "name": "กระดูกจมูก (Nasal Bones)",
    "description": "กระดูกเล็กๆ 2 ชิ้นที่สร้างสันจมูก อยู่ระหว่างดวงตาทั้งสอง ทำหน้าที่รองรับและปกป้องส่วนบนของโพรงจมูก",
    "color": "#ff8fa3"
  },
  "maxilla": {
    "name": "กระดูกขากรรไกรบน (Maxilla)",
    "description": "กระดูกใหญ่ 2 ชิ้นที่ประกอบกันเป็นขากรรไกรบน มีฟันบนฝังอยู่ ทำหน้าที่เป็นส่วนหนึ่งของเบ้าตา โพรงจมูก และเพดานปาก",
    "color": "#ff8fa3"
  },
  "zygomatic": {
    "name": "กระดูกโหนกแก้ม (Zygomatic Bones)",
    "description": "กระดูก 2 ชิ้นที่สร้างโหนกแก้ม เชื่อมระหว่างกระดูกหน้าผากและขมับ ทำหน้าที่ปกป้องด้านข้างของใบหน้าและเป็นส่วนหนึ่งของเบ้าตา",
    "color": "#ff8fa3"
  },
  "mandible": {
    "name": "กระดูกขากรรไกรล่าง (Mandible)",
    "description": "กระดูกใบหน้าชิ้นใหญ่ที่สุดและแข็งแรงที่สุด เป็นเพียงกระดูกใบหน้าที่สามารถเคลื่อนไหวได้ มีฟันล่างฝังอยู่ ทำหน้าที่ในการเคี้ยวและพูด",
    "color": "#ff8fa3"
  },
  "lacrimal": {
    "name": "กระดูกต่อมน้ำตา (Lacrimal Bones)",
    "description": "กระดูกเล็กที่สุดของใบหน้า มี 2 ชิ้น อยู่ที่มุมในของเบ้าตา มีร่องสำหรับท่อน้ำตาผ่าน ทำหน้าที่เป็นส่วนหนึ่งของทางเดินน้ำตา",
    "color": "#ff8fa3"
  },
  "palatine": {
    "name": "กระดูกเพดานปาก (Palatine Bones)",
    "description": "กระดูก 2 ชิ้นรูปตัว L ที่อยู่ด้านหลังของกระดูกขากรรไกรบน เป็นส่วนหนึ่งของเพดานปาก โพรงจมูก และเบ้าตา",
    "color": "#ff8fa3"
  },
  "vomer": {
    "name": "กระดูกผาแบ่งจมูก (Vomer)",
    "description": "กระดูกแบนบางรูปผาที่แบ่งโพรงจมูกออกเป็นสองด้าน ทำหน้าที่เป็นส่วนหนึ่งของผนังกั้นจมูกส่วนหลัง",
    "color": "#ff8fa3"
  },
  "inferiorNasalConcha": {
    "name": "กระดูกฟองจมูกล่าง (Inferior Nasal Conchae)",
    "description": "กระดูกม้วนงอ 2 ชิ้นที่ยื่นออกจากผนังด้านข้างของโพรงจมูก ทำหน้าที่เพิ่มพื้นที่ผิวของโพรงจมูก ช่วยกรองและให้ความอบอุ่นแก่อากาศ",
    "color": "#ff8fa3"
  },
  "malleus": {
    "name": "กระดูกค้อน (Malleus)",
    "description": "กระดูกเล็กที่สุดในร่างกาย 1 ใน 3 ชิ้นของหูชั้นกลาง มี 2 ข้าง รูปร่างคล้ายค้อน ติดกับแก้วหูและส่งผ่านการสั่นสะเทือนของเสียง",
    "color": "#ffb4a2"
  },
  "incus": {
    "name": "กระดูกทั่ง (Incus)",
    "description": "กระดูกหูชั้นกลางที่อยู่ระหว่างกระดูกค้อนและกระดูกโกลน มี 2 ข้าง รูปร่างคล้ายทั่ง ทำหน้าที่ถ่ายทอดการสั่นสะเทือนของเสียง",
    "color": "#ffb4a2"
  },
  "stapes": {
    "name": "กระดูกโกลน (Stapes)",
    "description": "กระดูกเล็กที่สุดในร่างกายมนุษย์ มี 2 ข้าง รูปร่างคล้ายโกลน ติดกับหน้าต่างรูปไข่ของหูชั้นใน ทำหน้าที่ส่งผ่านการสั่นสะเทือนเข้าสู่หูชั้นใน",
    "color": "#ffb4a2"
  },
  "hyoid": {
    "name": "กระดูกลิ้น (Hyoid Bone)",
    "description": "กระดูกรูปตัว U ที่อยู่ที่คอส่วนบน ไม่ได้เชื่อมกับกระดูกอื่นๆ แต่ถูกยึดด้วยกล้ามเนื้อและเอ็น ทำหน้าที่เป็นจุดยึดของลิ้นและกล้ามเนื้อคอ ช่วยในการกลืนและพูด",
    "color": "#ffcdb2"
  },
  "c1": {
    "name": "กระดูกคอชิ้นที่ 1 (Atlas - C1)",
    "description": "กระดูกคอชิ้นแรกที่รองรับกะโหลกศีรษะ มีรูปร่างเป็นวงแหวน ไม่มีลำตัว ทำให้ศีรษะสามารถพยักหน้าขึ้นลงได้ ชื่อตามเทพ Atlas ที่แบกโลกไว้",
    "color": "#ffd93d"
  },
  "c2": {
    "name": "กระดูกคอชิ้นที่ 2 (Axis - C2)",
    "description": "กระดูกคอชิ้นที่สอง มีส่วนยื่นขึ้นมาชื่อว่า Odontoid process เป็นแกนหมุนให้ C1 และกะโหลกศีรษะหมุนซ้ายขวาได้ ช่วยให้ศีรษะส่ายได้",
    "color": "#ffd93d"
  },
  "c3": {
    "name": "กระดูกคอชิ้นที่ 3 (C3)",
    "description": "กระดูกคอชิ้นที่สาม มีขนาดเล็กและเบา ทำหน้าที่รองรับน้ำหนักและช่วยในการเคลื่อนไหวของคอ เป็นที่ยึดของกล้ามเนื้อคอ",
    "color": "#ffd93d"
  },
  "c4": {
    "name": "กระดูกคอชิ้นที่ 4 (C4)",
    "description": "กระดูกคอชิ้นที่สี่ อยู่ในระดับเดียวกับมุมขากรรไกร ทำหน้าที่รองรับน้ำหนักและเคลื่อนไหวของคอ เส้นประสาทที่ออกจาก C4 ควบคุมการหายใจผ่านกะบังลม",
    "color": "#ffd93d"
  },
  "c5": {
    "name": "กระดูกคอชิ้นที่ 5 (C5)",
    "description": "กระดูกคอชิ้นที่ห้า อยู่ในตำแหน่งกลางของคอ เส้นประสาทที่ออกจาก C5 ควบคุมกล้ามเนื้อไหล่และต้นแขน เป็นส่วนหนึ่งของ Brachial plexus",
    "color": "#ffd93d"
  },
  "c6": {
    "name": "กระดูกคอชิ้นที่ 6 (C6)",
    "description": "กระดูกคอชิ้นที่หก อยู่ในระดับกระดูกอ่อนของกล่องเสียง เส้นประสาทที่ออกจาก C6 ควบคุมกล้ามเนื้อข้อมือและนิ้วหัวแม่มือ",
    "color": "#ffd93d"
  },
  "c7": {
    "name": "กระดูกคอชิ้นที่ 7 (C7)",
    "description": "กระดูกคอชิ้นสุดท้าย มีส่วนยื่นด้านหลังที่โดดเด่น สามารถสัมผัสได้ที่ฐานคอ เป็นจุดเปลี่ยนระหว่างกระดูกคอและกระดูกหลังส่วนทรวงอก",
    "color": "#ffd93d"
  },
  "cervical": {
    "name": "กระดูกคอ (Cervical Vertebrae)",
    "description": "กระดูกสันหลังส่วนคอ 7 ชิ้น (C1-C7) มีขนาดเล็กและโครงสร้างที่เอื้อต่อการเคลื่อนไหว ทำให้คอสามารถเคลื่อนไหวได้อย่างอิสระ มีช่องให้เส้นเลือดผ่าน",
    "color": "#ffd93d"
  },
  "t1": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 1 (T1)",
    "description": "กระดูกหลังชิ้นแรกของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่แรก มีส่วนยื่นด้านหลังที่ยาวและชี้ลง เส้นประสาทที่ออกจาก T1 ควบคุมมือ",
    "color": "#ffd93d"
  },
  "t2": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 2 (T2)",
    "description": "กระดูกหลังชิ้นที่สองของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่สอง อยู่ในระดับของหัก superior angle ของกระดูกสะบัก",
    "color": "#ffd93d"
  },
  "t3": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 3 (T3)",
    "description": "กระดูกหลังชิ้นที่สามของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่สาม อยู่ในระดับของ spine ของกระดูกสะบัก",
    "color": "#ffd93d"
  },
  "t4": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 4 (T4)",
    "description": "กระดูกหลังชิ้นที่สี่ของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่สี่ อยู่ในระดับของกระดูกหน้าอกส่วนบน (Sternal angle)",
    "color": "#ffd93d"
  },
  "t5": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 5 (T5)",
    "description": "กระดูกหลังชิ้นที่ห้าของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่ห้า อยู่ในระดับกลางของกระดูกหน้าอก",
    "color": "#ffd93d"
  },
  "t6": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 6 (T6)",
    "description": "กระดูกหลังชิ้นที่หกของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่หก อยู่ในระดับของ inferior angle ของกระดูกสะบัก",
    "color": "#ffd93d"
  },
  "t7": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 7 (T7)",
    "description": "กระดูกหลังชิ้นที่เจ็ดของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่เจ็ด อยู่ในระดับของปลายกระดูกหน้าอก (Xiphoid process)",
    "color": "#ffd93d"
  },
  "t8": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 8 (T8)",
    "description": "กระดูกหลังชิ้นที่แปดของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่แปด เป็นกระดูกซี่โครง False rib ชิ้นแรก",
    "color": "#ffd93d"
  },
  "t9": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 9 (T9)",
    "description": "กระดูกหลังชิ้นที่เก้าของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่เก้า อยู่ในตำแหน่งที่เริ่มมีการโค้งไปข้างหน้าของกระดูกสันหลัง",
    "color": "#ffd93d"
  },
  "t10": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 10 (T10)",
    "description": "กระดูกหลังชิ้นที่สิบของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่สิบ เริ่มมีลักษณะใกล้เคียงกับกระดูกหลังส่วนเอว",
    "color": "#ffd93d"
  },
  "t11": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 11 (T11)",
    "description": "กระดูกหลังชิ้นที่สิบเอ็ดของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่สิบเอ็ด เป็น Floating rib ที่ไม่เชื่อมกับกระดูกหน้าอก",
    "color": "#ffd93d"
  },
  "t12": {
    "name": "กระดูกหลังส่วนทรวงอกชิ้นที่ 12 (T12)",
    "description": "กระดูกหลังชิ้นสุดท้ายของส่วนทรวงอก เชื่อมกับกระดูกซี่โครงคู่ที่สิบสอง เป็น Floating rib และเป็นจุดเปลี่ยนไปสู่กระดูกหลังส่วนเอว",
    "color": "#ffd93d"
  },
  "thoracic": {
    "name": "กระดูกหลังส่วนทรวงอก (Thoracic Vertebrae)",
    "description": "กระดูกสันหลังส่วนทรวงอก 12 ชิ้น (T1-T12) มีขนาดใหญ่กว่ากระดูกคอ แต่ละชิ้นเชื่อมกับกระดูกซี่โครง ทำหน้าที่รองรับน้ำหนักและปกป้องอวัยวะในทรวงอก",
    "color": "#ffd93d"
  },
  "l1": {
    "name": "กระดูกเอวชิ้นที่ 1 (L1)",
    "description": "กระดูกเอวชิ้นแรก มีขนาดใหญ่กว่ากระดูกหลังส่วนทรวงอก อยู่ในระดับของกระดูกซี่โครงคู่ล่างสุด รองรับน้ำหนักตัวส่วนบน",
    "color": "#ffd93d"
  },
  "l2": {
    "name": "กระดูกเอวชิ้นที่ 2 (L2)",
    "description": "กระดูกเอวชิ้นที่สอง อยู่ในระดับเดียวกับปลายไขสันหลัง (Conus medullaris) ทำหน้าที่รองรับน้ำหนักและเป็นจุดยึดของกล้ามเนื้อหลัง",
    "color": "#ffd93d"
  },
  "l3": {
    "name": "กระดูกเอวชิ้นที่ 3 (L3)",
    "description": "กระดูกเอวชิ้นที่สาม อยู่ในตำแหน่งกลางของกระดูกเอว เป็นจุดที่มีแรงกดมากที่สุด เป็นที่นิยมในการเจาะไขสันหลัง (Lumbar puncture)",
    "color": "#ffd93d"
  },
  "l4": {
    "name": "กระดูกเอวชิ้นที่ 4 (L4)",
    "description": "กระดูกเอวชิ้นที่สี่ อยู่ในระดับของสันกระดูกเชิงกราน (Iliac crest) เป็นจุดสังเกตสำคัญในการตรวจร่างกาย",
    "color": "#ffd93d"
  },
  "l5": {
    "name": "กระดูกเอวชิ้นที่ 5 (L5)",
    "description": "กระดูกเอวชิ้นสุดท้าย มีขนาดใหญ่ที่สุด เชื่อมกับกระดูก Sacrum รองรับน้ำหนักตัวทั้งหมดและถ่ายไปยังกระดูกเชิงกราน บริเวณนี้พบปัญหาหมอนรองกระดูกบ่อย",
    "color": "#ffd93d"
  },
  "lumbar": {
    "name": "กระดูกเอว (Lumbar Vertebrae)",
    "description": "กระดูกสันหลังส่วนเอว 5 ชิ้น (L1-L5) มีขนาดใหญ่ที่สุดในกระดูกสันหลัง ทำหน้าที่รองรับน้ำหนักตัวส่วนใหญ่ เป็นบริเวณที่พบปัญหาเจ็บหลังบ่อยที่สุด",
    "color": "#ffd93d"
  },
  "sacrum": {
    "name": "กระดูกกระเบนเหน็บ (Sacrum)",
    "description": "กระดูกรูปสามเหลี่ยมที่เกิดจากกระดูก 5 ชิ้นหลอมรวมกัน อยู่ระหว่างกระดูกเอวและกระดูกก้นกบ เชื่อมกระดูกสันหลังกับกระดูกเชิงกราน ทำหน้าที่รองรับน้ำหนักและถ่ายไปยังขา",
    "color": "#ffd93d"
  },
  "coccyx": {
    "name": "กระดูกก้นกบ (Coccyx)",
    "description": "กระดูกที่เล็กที่สุดของกระดูกสันหลัง เกิดจากกระดูก 3-5 ชิ้นหลอมรวมกัน อยู่ปลายสุดของกระดูกสันหลัง เป็นซากของหางในการวิวัฒนาการ ทำหน้าที่เป็นจุดยึดของกล้ามเนื้อพื้นเชิงกราน",
    "color": "#ffd93d"
  },
  "spine": {
    "name": "กระดูกสันหลัง (Vertebral Column)",
    "description": "แกนกลางของโครงกระดูก ประกอบด้วยกระดูกสันหลัง 33 ชิ้น แบ่งเป็น คอ 7 ชิ้น, ทรวงอก 12 ชิ้น, เอว 5 ชิ้น, กระเบนเหน็บ 5 ชิ้น และก้นกบ 4 ชิ้น ทำหน้าที่รองรับน้ำหนักตัวและปกป้องไขสันหลัง",
    "color": "#ffd93d"
  },
  "rib1": {
    "name": "กระดูกซี่โครงคู่ที่ 1",
    "description": "กระดูกซี่โครงคู่แรก สั้นและโค้งมากที่สุด อยู่สูงสุดและเชื่อมกับ T1 ปกป้องหลอดเลือดและเส้นประสาทที่ไปยังแขน",
    "color": "#4ecdc4"
  },
  "rib2": {
    "name": "กระดูกซี่โครงคู่ที่ 2",
    "description": "กระดูกซี่โครงคู่ที่สอง ยาวกว่าคู่แรกเล็กน้อย เชื่อมกับ T2 มีลักษณะคล้ายคู่แรก",
    "color": "#4ecdc4"
  },
  "rib3": {
    "name": "กระดูกซี่โครงคู่ที่ 3",
    "description": "กระดูกซี่โครงคู่ที่สาม เชื่อมกับ T3 เริ่มมีลักษณะคล้ายกับซี่โครงคู่อื่นๆ",
    "color": "#4ecdc4"
  },
  "rib4": {
    "name": "กระดูกซี่โครงคู่ที่ 4",
    "description": "กระดูกซี่โครงคู่ที่สี่ เชื่อมกับ T4 อยู่ในระดับของหัวใจ ช่วยปกป้องหัวใจและปอด",
    "color": "#4ecdc4"
  },
  "rib5": {
    "name": "กระดูกซี่โครงคู่ที่ 5",
    "description": "กระดูกซี่โครงคู่ที่ห้า เชื่อมกับ T5 อยู่ในตำแหน่งกลางของทรวงอก",
    "color": "#4ecdc4"
  },
  "rib6": {
    "name": "กระดูกซี่โครงคู่ที่ 6",
    "description": "กระดูกซี่โครงคู่ที่หก เชื่อมกับ T6 เป็นซี่โครง True rib คู่ใหญ่ที่สุด",
    "color": "#4ecdc4"
  },
  "rib7": {
    "name": "กระดูกซี่โครงคู่ที่ 7",
    "description": "กระดูกซี่โครงคู่ที่เจ็ด เชื่อมกับ T7 เป็น True rib คู่สุดท้ายที่เชื่อมตรงกับกระดูกหน้าอก",
    "color": "#4ecdc4"
  },
  "rib8": {
    "name": "กระดูกซี่โครงคู่ที่ 8",
    "description": "กระดูกซี่โครงคู่ที่แปด เชื่อมกับ T8 เป็น False rib คู่แรก เชื่อมกับกระดูกหน้าอกผ่านกระดูกอ่อน",
    "color": "#4ecdc4"
  },
  "rib9": {
    "name": "กระดูกซี่โครงคู่ที่ 9",
    "description": "กระดูกซี่โครงคู่ที่เก้า เชื่อมกับ T9 เป็น False rib เชื่อมกับกระดูกอ่อนของซี่โครงข้างบน",
    "color": "#4ecdc4"
  },
  "rib10": {
    "name": "กระดูกซี่โครงคู่ที่ 10",
    "description": "กระดูกซี่โครงคู่ที่สิบ เชื่อมกับ T10 เป็น False rib เชื่อมกับกระดูกอ่อนของซี่โครงข้างบน",
    "color": "#4ecdc4"
  },
  "rib11": {
    "name": "กระดูกซี่โครงคู่ที่ 11",
    "description": "กระดูกซี่โครงคู่ที่สิบเอ็ด เชื่อมกับ T11 เป็น Floating rib ไม่เชื่อมกับกระดูกหน้าอก สั้นและลอยอิสระ",
    "color": "#4ecdc4"
  },
  "rib12": {
    "name": "กระดูกซี่โครงคู่ที่ 12",
    "description": "กระดูกซี่โครงคู่ที่สิบสอง เชื่อมกับ T12 เป็น Floating rib คู่สุดท้าย สั้นที่สุดและลอยอิสระ ปกป้องไต",
    "color": "#4ecdc4"
  },
  "ribs": {
    "name": "กระดูกซี่โครง (Ribs)",
    "description": "กระดูกโค้งที่ห่อหุ้มทรวงอก มี 12 คู่ (24 ชิ้น) แบ่งเป็น True ribs 7 คู่, False ribs 3 คู่, และ Floating ribs 2 คู่ ทำหน้าที่ปกป้องหัวใจและปอด ช่วยในการหายใจ",
    "color": "#4ecdc4"
  },
  "sternum": {
    "name": "กระดูกหน้าอก (Sternum)",
    "description": "กระดูกแบนยาวที่อยู่กลางหน้าอก ประกอบด้วย Manubrium (ด้านบน), Body (ลำตัว), และ Xiphoid process (ปลายล่าง) เชื่อมกับกระดูกซี่โครง 7 คู่แรกและกระดูกไหปลาร้า ทำหน้าที่ปกป้องหัวใจและเป็นจุดยึดของกล้ามเนื้อ",
    "color": "#95e1d3"
  },
  "xiphoidProcess": {
    "name": "ปลายกระดูกหน้าอก (Xiphoid Process)",
    "description": "ส่วนปลายล่างสุดของกระดูกหน้าอก เป็นกระดูกอ่อนที่จะแข็งตัวเป็นกระดูกในผู้ใหญ่ ทำหน้าที่เป็นจุดยึดของกล้ามเนื้อหน้าท้องและกะบังลม มีรูปร่างเล็กและยื่นลงมา",
    "color": "#95e1d3"
  },
  "clavicle": {
    "name": "กระดูกไหปลาร้า (Clavicle)",
    "description": "กระดูกยาวรูป S ที่เชื่อมระหว่างกระดูกหน้าอกกับกระดูกสะบัก มี 2 ข้าง ทำหน้าที่เชื่อมแขนเข้ากับลำตัว ช่วยในการเคลื่อนไหวของไหล่ และรองรับน้ำหนักจากแขน เป็นกระดูกที่หักง่ายที่สุด",
    "color": "#a8dadc"
  },
  "clavicleLeft": {
    "name": "กระดูกไหปลาร้าซ้าย (Left Clavicle)",
    "description": "กระดูกไหปลาร้าด้านซ้าย เชื่อมระหว่างกระดูกหน้าอกกับกระดูกสะบักซ้าย ทำหน้าที่เชื่อมแขนซ้ายเข้ากับลำตัว",
    "color": "#a8dadc"
  },
  "clavicleRight": {
    "name": "กระดูกไหปลาร้าขวา (Right Clavicle)",
    "description": "กระดูกไหปลาร้าด้านขวา เชื่อมระหว่างกระดูกหน้าอกกับกระดูกสะบักขวา ทำหน้าที่เชื่อมแขนขวาเข้ากับลำตัว",
    "color": "#a8dadc"
  },
  "scapula": {
    "name": "กระดูกสะบัก (Scapula)",
    "description": "กระดูกรูปสามเหลี่ยมแบนที่อยู่ด้านหลังหัวไหล่ มี 2 ข้าง เป็นจุดยึดของกล้ามเนื้อหลายตัว และเป็นส่วนหนึ่งของข้อไหล่ ช่วยให้แขนเคลื่อนไหวได้หลากหลายทิศทาง",
    "color": "#a8dadc"
  },
  "scapulaLeft": {
    "name": "กระดูกสะบักซ้าย (Left Scapula)",
    "description": "กระดูกสะบักด้านซ้าย อยู่ด้านหลังของทรวงอกซ้าย เป็นส่วนหนึ่งของข้อไหล่ซ้าย",
    "color": "#a8dadc"
  },
  "scapulaRight": {
    "name": "กระดูกสะบักขวา (Right Scapula)",
    "description": "กระดูกสะบักด้านขวา อยู่ด้านหลังของทรวงอกขวา เป็นส่วนหนึ่งของข้อไหล่ขวา",
    "color": "#a8dadc"
  },
  "humerus": {
    "name": "กระดูกต้นแขน (Humerus)",
    "description": "กระดูกยาวที่ใหญ่ที่สุดในแขน เชื่อมระหว่างข้อไหล่และข้อศอก มี 2 ข้าง ด้านบนเป็นข้อต่อกับกระดูกสะบัก ด้านล่างเป็นข้อต่อกับกระดูกปลายแขน เป็นที่ยึดของกล้ามเนื้อที่สำคัญ",
    "color": "#a8dadc"
  },
  "humerusLeft": {
    "name": "กระดูกต้นแขนซ้าย (Left Humerus)",
    "description": "กระดูกต้นแขนด้านซ้าย เชื่อมระหว่างข้อไหล่ซ้ายและข้อศอกซ้าย ทำหน้าที่รองรับการเคลื่อนไหวของแขนซ้าย",
    "color": "#a8dadc"
  },
  "humerusRight": {
    "name": "กระดูกต้นแขนขวา (Right Humerus)",
    "description": "กระดูกต้นแขนด้านขวา เชื่อมระหว่างข้อไหล่ขวาและข้อศอกขวา ทำหน้าที่รองรับการเคลื่อนไหวของแขนขวา",
    "color": "#a8dadc"
  },
  "radius": {
    "name": "กระดูกปลายแขนด้านนอก (Radius)",
    "description": "กระดูกปลายแขนด้านนอก (ด้านนิ้วหัวแม่มือ) อยู่ข้างกระดูก Ulna มี 2 ข้าง ทำหน้าที่หมุนข้อมือและรองรับน้ำหนักจากมือ เป็นกระดูกที่พบการหักบ่อย",
    "color": "#a8dadc"
  },
  "radiusLeft": {
    "name": "กระดูกปลายแขนด้านนอกซ้าย (Left Radius)",
    "description": "กระดูก Radius ด้านซ้าย อยู่ด้านนอก (ด้านนิ้วหัวแม่มือ) ของปลายแขนซ้าย ทำหน้าที่หมุนข้อมือซ้าย",
    "color": "#a8dadc"
  },
  "radiusRight": {
    "name": "กระดูกปลายแขนด้านนอกขวา (Right Radius)",
    "description": "กระดูก Radius ด้านขวา อยู่ด้านนอก (ด้านนิ้วหัวแม่มือ) ของปลายแขนขวา ทำหน้าที่หมุนข้อมือขวา",
    "color": "#a8dadc"
  },
  "ulna": {
    "name": "กระดูกปลายแขนด้านใน (Ulna)",
    "description": "กระดูกปลายแขนด้านใน (ด้านนิ้วก้อย) ยาวกว่า Radius เล็กน้อย มี 2 ข้าง ด้านบนเป็นส่วนสำคัญของข้อศอก ทำหน้าที่เป็นจุดยึดและแกนหมุนของข้อมือ",
    "color": "#a8dadc"
  },
  "ulnaLeft": {
    "name": "กระดูกปลายแขนด้านในซ้าย (Left Ulna)",
    "description": "กระดูก Ulna ด้านซ้าย อยู่ด้านใน (ด้านนิ้วก้อย) ของปลายแขนซ้าย เป็นส่วนสำคัญของข้อศอกซ้าย",
    "color": "#a8dadc"
  },
  "ulnaRight": {
    "name": "กระดูกปลายแขนด้านในขวา (Right Ulna)",
    "description": "กระดูก Ulna ด้านขวา อยู่ด้านใน (ด้านนิ้วก้อย) ของปลายแขนขวา เป็นส่วนสำคัญของข้อศอกขวา",
    "color": "#a8dadc"
  },
  "carpal": {
    "name": "กระดูกข้อมือ (Carpal Bones)",
    "description": "กระดูกเล็กๆ 8 ชิ้นในแต่ละข้อมือ จัดเรียงเป็น 2 แถว ประกอบด้วย Scaphoid, Lunate, Triquetrum, Pisiform, Trapezium, Trapezoid, Capitate, และ Hamate ทำให้ข้อมือเคลื่อนไหวได้อย่างยืดหยุ่น",
    "color": "#a8dadc"
  },
  "scaphoid": {
    "name": "กระดูกเรือข้อมือ (Scaphoid)",
    "description": "กระดูกข้อมือที่ใหญ่ที่สุดในแถวใกล้ต้นแขน อยู่ใต้นิ้วหัวแม่มือ มี 2 ข้าง รูปร่างคล้ายเรือ เป็นกระดูกข้อมือที่หักบ่อยที่สุด",
    "color": "#a8dadc"
  },
  "lunate": {
    "name": "กระดูกเสี้ยวจันทร์ข้อมือ (Lunate)",
    "description": "กระดูกข้อมือรูปเสี้ยวจันทร์ อยู่ตรงกลางแถวใกล้ต้นแขน มี 2 ข้าง เชื่อมกับกระดูก Radius",
    "color": "#a8dadc"
  },
  "triquetrum": {
    "name": "กระดูกสามเหลี่ยมข้อมือ (Triquetrum)",
    "description": "กระดูกข้อมือรูปปิรามิด อยู่ด้านนิ้วก้อยของแถวใกล้ต้นแขน มี 2 ข้าง",
    "color": "#a8dadc"
  },
  "pisiform": {
    "name": "กระดูกเม็ดถั่วข้อมือ (Pisiform)",
    "description": "กระดูกข้อมือที่เล็กที่สุด รูปกลมแบน อยู่ด้านหน้าของ Triquetrum มี 2 ข้าง สัมผัสได้ที่ฐานฝ่ามือด้านนิ้วก้อย",
    "color": "#a8dadc"
  },
  "trapezium": {
    "name": "กระดูกสี่เหลี่ยมคางหมูใหญ่ข้อมือ (Trapezium)",
    "description": "กระดูกข้อมือที่อยู่ใต้นิ้วหัวแม่มือ อยู่ในแถวไกลต้นแขน มี 2 ข้าง เชื่อมกับกระดูกฝ่ามือของนิ้วหัวแม่มือ",
    "color": "#a8dadc"
  },
  "trapezoid": {
    "name": "กระดูกสี่เหลี่ยมคางหมูเล็กข้อมือ (Trapezoid)",
    "description": "กระดูกข้อมือเล็กที่สุดชิ้นหนึ่ง อยู่ระหว่าง Trapezium และ Capitate มี 2 ข้าง",
    "color": "#a8dadc"
  },
  "capitate": {
    "name": "กระดูกหัวข้อมือ (Capitate)",
    "description": "กระดูกข้อมือที่ใหญ่ที่สุด อยู่ตรงกลางของแถวไกลต้นแขน มี 2 ข้าง เป็นศูนย์กลางของการเคลื่อนไหวข้อมือ",
    "color": "#a8dadc"
  },
  "hamate": {
    "name": "กระดูกขอข้อมือ (Hamate)",
    "description": "กระดูกข้อมือที่มีส่วนยื่นเป็นรูปขอ อยู่ด้านนิ้วก้อยของแถวไกลต้นแขน มี 2 ข้าง",
    "color": "#a8dadc"
  },
  "metacarpal": {
    "name": "กระดูกฝ่ามือ (Metacarpals)",
    "description": "กระดูกยาว 5 ชิ้นในฝ่ามือแต่ละข้าง เชื่อมระหว่างข้อมือกับนิ้วมือ นับเป็น Metacarpal 1-5 จากนิ้วหัวแม่มือไปนิ้วก้อย",
    "color": "#a8dadc"
  },
  "metacarpal1": {
    "name": "กระดูกฝ่ามือที่ 1 (First Metacarpal)",
    "description": "กระดูกฝ่ามือของนิ้วหัวแม่มือ มี 2 ข้าง สั้นและหนากว่าชิ้นอื่น เคลื่อนไหวได้อิสระมากที่สุด",
    "color": "#a8dadc"
  },
  "metacarpal2": {
    "name": "กระดูกฝ่ามือที่ 2 (Second Metacarpal)",
    "description": "กระดูกฝ่ามือของนิ้วชี้ มี 2 ข้าง ยาวที่สุดในกระดูกฝ่ามือ",
    "color": "#a8dadc"
  },
  "metacarpal3": {
    "name": "กระดูกฝ่ามือที่ 3 (Third Metacarpal)",
    "description": "กระดูกฝ่ามือของนิ้วกลาง มี 2 ข้าง อยู่ตรงกลางของฝ่ามือ",
    "color": "#a8dadc"
  },
  "metacarpal4": {
    "name": "กระดูกฝ่ามือที่ 4 (Fourth Metacarpal)",
    "description": "กระดูกฝ่ามือของนิ้วนาง มี 2 ข้าง เคลื่อนไหวได้บ้างเล็กน้อย",
    "color": "#a8dadc"
  },
  "metacarpal5": {
    "name": "กระดูกฝ่ามือที่ 5 (Fifth Metacarpal)",
    "description": "กระดูกฝ่ามือของนิ้วก้อย มี 2 ข้าง สั้นและเคลื่อนไหวได้มากกว่าชิ้นที่ 2-4 เป็นกระดูกที่หักบ่อยจากการชก",
    "color": "#a8dadc"
  },
  "phalanx": {
    "name": "กระดูกนิ้วมือ (Phalanges - Hand)",
    "description": "กระดูกนิ้วมือ แต่ละมือมี 14 ชิ้น นิ้วหัวแม่มือมี 2 ชิ้น (Proximal และ Distal) นิ้วอื่นมีอย่างละ 3 ชิ้น (Proximal, Middle, Distal) ทำให้นิ้วมือสามารถงอและจับของได้",
    "color": "#a8dadc"
  },
  "proximalPhalanx": {
    "name": "กระดูกนิ้วมือส่วนโคน (Proximal Phalanges)",
    "description": "กระดูกนิ้วมือชิ้นที่อยู่ใกล้ฝ่ามือที่สุด แต่ละมือมี 5 ชิ้น เป็นกระดูกนิ้วที่ยาวที่สุด",
    "color": "#a8dadc"
  },
  "middlePhalanx": {
    "name": "กระดูกนิ้วมือส่วนกลาง (Middle Phalanges)",
    "description": "กระดูกนิ้วมือชิ้นกลาง แต่ละมือมี 4 ชิ้น (นิ้วหัวแม่มือไม่มี) สั้นกว่า Proximal phalanx",
    "color": "#a8dadc"
  },
  "distalPhalanx": {
    "name": "กระดูกนิ้วมือส่วนปลาย (Distal Phalanges)",
    "description": "กระดูกนิ้วมือชิ้นปลายสุด แต่ละมือมี 5 ชิ้น เล็กที่สุดและรองรับเล็บ",
    "color": "#a8dadc"
  },
  "hand": {
    "name": "กระดูกมือ (Hand Bones)",
    "description": "ประกอบด้วยกระดูก 27 ชิ้นในแต่ละมือ แบ่งเป็นกระดูกข้อมือ (Carpals) 8 ชิ้น, กระดูกฝ่ามือ (Metacarpals) 5 ชิ้น, และกระดูกนิ้วมือ (Phalanges) 14 ชิ้น ทำให้มือสามารถจับถือและทำงานละเอียดได้",
    "color": "#a8dadc"
  },
  "handLeft": {
    "name": "กระดูกมือซ้าย (Left Hand Bones)",
    "description": "กระดูกมือซ้ายทั้งหมด 27 ชิ้น ประกอบด้วยข้อมือ ฝ่ามือ และนิ้วมือ ทำให้มือซ้ายสามารถจับถือและทำงานได้",
    "color": "#a8dadc"
  },
  "handRight": {
    "name": "กระดูกมือขวา (Right Hand Bones)",
    "description": "กระดูกมือขวาทั้งหมด 27 ชิ้น ประกอบด้วยข้อมือ ฝ่ามือ และนิ้วมือ ทำให้มือขวาสามารถจับถือและทำงานได้",
    "color": "#a8dadc"
  },
  "pelvis": {
    "name": "กระดูกเชิงกราน (Pelvis)",
    "description": "โครงสร้างกระดูกรูปชามที่รองรับอวัยวะภายในช่องท้องส่วนล่าง ประกอบด้วยกระดูก Ilium, Ischium, และ Pubis ที่หลอมรวมกัน รวมกับ Sacrum และ Coccyx ทำหน้าที่รองรับน้ำหนักลำตัว เชื่อมขากับลำตัว และเป็นทางผ่านของทารกขณะคลอด",
    "color": "#ffe66d"
  },
  "ilium": {
    "name": "กระดูกตะโพก (Ilium)",
    "description": "กระดูกส่วนบนและใหญ่ที่สุดของเชิงกราน มี 2 ข้าง มีส่วนยื่นด้านบนเป็นสันกระดูกเชิงกรานที่สัมผัสได้ ทำหน้าที่รองรับอวัยวะภายในและเป็นจุดยึดของกล้ามเนื้อ",
    "color": "#ffe66d"
  },
  "iliumLeft": {
    "name": "กระดูกตะโพกซ้าย (Left Ilium)",
    "description": "กระดูก Ilium ด้านซ้าย เป็นส่วนบนของเชิงกรานซ้าย ทำหน้าที่รองรับอวัยวะภายในด้านซ้าย",
    "color": "#ffe66d"
  },
  "iliumRight": {
    "name": "กระดูกตะโพกขวา (Right Ilium)",
    "description": "กระดูก Ilium ด้านขวา เป็นส่วนบนของเชิงกรานขวา ทำหน้าที่รองรับอวัยวะภายในด้านขวา",
    "color": "#ffe66d"
  },
  "ischium": {
    "name": "กระดูกนั่ง (Ischium)",
    "description": "กระดูกส่วนล่างและหลังของเชิงกราน มี 2 ข้าง เป็นส่วนที่รองรับน้ำหนักตัวเมื่อนั่ง มีส่วนยื่นที่เรียกว่า Ischial tuberosity",
    "color": "#ffe66d"
  },
  "ischiumLeft": {
    "name": "กระดูกนั่งซ้าย (Left Ischium)",
    "description": "กระดูก Ischium ด้านซ้าย เป็นส่วนล่างและหลังของเชิงกรานซ้าย รองรับน้ำหนักเมื่อนั่ง",
    "color": "#ffe66d"
  },
  "ischiumRight": {
    "name": "กระดูกนั่งขวา (Right Ischium)",
    "description": "กระดูก Ischium ด้านขวา เป็นส่วนล่างและหลังของเชิงกรานขวา รองรับน้ำหนักเมื่อนั่ง",
    "color": "#ffe66d"
  },
  "pubis": {
    "name": "กระดูกหน้าหัวหน้าท้อง (Pubis)",
    "description": "กระดูกส่วนหน้าของเชิงกราน มี 2 ข้าง เชื่อมกันตรงกลางด้วยกระดูกอ่อนที่เรียกว่า Pubic symphysis ทำหน้าที่เป็นส่วนหนึ่งของข้อสะโพกและรองรับน้ำหนัก",
    "color": "#ffe66d"
  },
  "pubisLeft": {
    "name": "กระดูกหน้าหัวหน้าท้องซ้าย (Left Pubis)",
    "description": "กระดูก Pubis ด้านซ้าย เป็นส่วนหน้าของเชิงกรานซ้าย เชื่อมกับ Pubis ขวาตรงกลาง",
    "color": "#ffe66d"
  },
  "pubisRight": {
    "name": "กระดูกหน้าหัวหน้าท้องขวา (Right Pubis)",
    "description": "กระดูก Pubis ด้านขวา เป็นส่วนหน้าของเชิงกรานขวา เชื่อมกับ Pubis ซ้ายตรงกลาง",
    "color": "#ffe66d"
  },
  "femur": {
    "name": "กระดูกต้นขา (Femur)",
    "description": "กระดูกที่ยาวและแข็งแรงที่สุดในร่างกาย มี 2 ข้าง เชื่อมระหว่างกระดูกเชิงกรานและกระดูกหน้าแข้ง รองรับน้ำหนักตัวทั้งหมด ด้านบนเป็นข้อสะโพก ด้านล่างเป็นข้อเข่า สามารถรองรับน้ำหนักได้ถึง 30 เท่าของน้ำหนักตัว",
    "color": "#95e1d3"
  },
  "femurLeft": {
    "name": "กระดูกต้นขาซ้าย (Left Femur)",
    "description": "กระดูกต้นขาด้านซ้าย เชื่อมระหว่างข้อสะโพกซ้ายและข้อเข่าซ้าย รองรับน้ำหนักตัวครึ่งซ้าย",
    "color": "#95e1d3"
  },
  "femurRight": {
    "name": "กระดูกต้นขาขวา (Right Femur)",
    "description": "กระดูกต้นขาด้านขวา เชื่อมระหว่างข้อสะโพกขวาและข้อเข่าขวา รองรับน้ำหนักตัวครึ่งขวา",
    "color": "#95e1d3"
  },
  "patella": {
    "name": "กระดูกสะบ้าหัวเข่า (Patella)",
    "description": "กระดูกรูปสามเหลี่ยมเล็กๆ ที่อยู่ด้านหน้าข้อเข่า มี 2 ข้าง ฝังอยู่ในเอ็นของกล้ามเนื้อต้นขา ทำหน้าที่ปกป้องข้อเข่าและเพิ่มประสิทธิภาพการทำงานของกล้ามเนื้อต้นขา เป็นกระดูก Sesamoid ที่ใหญ่ที่สุด",
    "color": "#95e1d3"
  },
  "patellaLeft": {
    "name": "กระดูกสะบ้าหัวเข่าซ้าย (Left Patella)",
    "description": "กระดูกสะบ้าหัวเข่าด้านซ้าย อยู่ด้านหน้าข้อเข่าซ้าย ปกป้องข้อเข่าซ้าย",
    "color": "#95e1d3"
  },
  "patellaRight": {
    "name": "กระดูกสะบ้าหัวเข่าขวา (Right Patella)",
    "description": "กระดูกสะบ้าหัวเข่าด้านขวา อยู่ด้านหน้าข้อเข่าขวา ปกป้องข้อเข่าขวา",
    "color": "#95e1d3"
  },
  "tibia": {
    "name": "กระดูกหน้าแข้ง (Tibia)",
    "description": "กระดูกขนาดใหญ่ของน่อง อยู่ด้านใน (ด้านนิ้วหัวแม่เท้า) มี 2 ข้าง รองรับน้ำหนักตัวส่วนใหญ่ เชื่อมข้อเข่ากับข้อเท้า เป็นกระดูกที่แข็งแรงเป็นอันดับสองรองจากกระดูกต้นขา สัมผัสได้ที่ด้านหน้าของน่อง",
    "color": "#95e1d3"
  },
  "tibiaLeft": {
    "name": "กระดูกหน้าแข้งซ้าย (Left Tibia)",
    "description": "กระดูกหน้าแข้งด้านซ้าย อยู่ด้านในของน่องซ้าย รองรับน้ำหนักตัวครึ่งซ้าย",
    "color": "#95e1d3"
  },
  "tibiaRight": {
    "name": "กระดูกหน้าแข้งขวา (Right Tibia)",
    "description": "กระดูกหน้าแข้งด้านขวา อยู่ด้านในของน่องขวา รองรับน้ำหนักตัวครึ่งขวา",
    "color": "#95e1d3"
  },
  "fibula": {
    "name": "กระดูกน่อง (Fibula)",
    "description": "กระดูกเรียวยาวของน่อง อยู่ด้านนอก (ด้านนิ้วก้อยเท้า) มี 2 ข้าง ไม่รองรับน้ำหนักโดยตรง แต่เป็นจุดยึดของกล้ามเนื้อและช่วยทำให้ข้อเท้ามั่นคง เป็นส่วนสำคัญของข้อเท้า",
    "color": "#95e1d3"
  },
  "fibulaLeft": {
    "name": "กระดูกน่องซ้าย (Left Fibula)",
    "description": "กระดูกน่องด้านซ้าย อยู่ด้านนอกของน่องซ้าย ช่วยรักษาเสถียรภาพของข้อเท้าซ้าย",
    "color": "#95e1d3"
  },
  "fibulaRight": {
    "name": "กระดูกน่องขวา (Right Fibula)",
    "description": "กระดูกน่องด้านขวา อยู่ด้านนอกของน่องขวา ช่วยรักษาเสถียรภาพของข้อเท้าขวา",
    "color": "#95e1d3"
  },
  "tarsal": {
    "name": "กระดูกข้อเท้า (Tarsal Bones)",
    "description": "กระดูก 7 ชิ้นในแต่ละข้อเท้า ประกอบด้วย Talus, Calcaneus, Navicular, Cuboid, และ Cuneiform 3 ชิ้น ทำหน้าที่รองรับน้ำหนักและช่วยในการเดิน",
    "color": "#95e1d3"
  },
  "talus": {
    "name": "กระดูกข้อเท้าส่วนบน (Talus)",
    "description": "กระดูกข้อเท้าที่อยู่สูงที่สุด มี 2 ข้าง เชื่อมระหว่างกระดูกน่องกับกระดูกส้นเท้า ทำหน้าที่รับน้ำหนักจากขาและกระจายไปยังเท้า เป็นกระดูกที่ไม่มีกล้ามเนื้อติดโดยตรง",
    "color": "#95e1d3"
  },
  "calcaneus": {
    "name": "กระดูกส้นเท้า (Calcaneus)",
    "description": "กระดูกที่ใหญ่ที่สุดของเท้า มี 2 ข้าง ทำหน้าที่รองรับน้ำหนักและเป็นจุดยึดของเอ็น Achilles ส้นเท้าที่เราเหยียบพื้นคือกระดูกชิ้นนี้",
    "color": "#95e1d3"
  },
  "navicular": {
    "name": "กระดูกเรือเท้า (Navicular)",
    "description": "กระดูกข้อเท้ารูปเรือ อยู่ด้านในของเท้า มี 2 ข้าง ทำหน้าที่เป็นส่วนหนึ่งของโค้งเท้าด้านใน สัมผัสได้ที่ด้านในของเท้า",
    "color": "#95e1d3"
  },
  "cuboid": {
    "name": "กระดูกลูกบาศก์เท้า (Cuboid)",
    "description": "กระดูกข้อเท้ารูปลูกบาศก์ อยู่ด้านนอกของเท้า มี 2 ข้าง เชื่อมระหว่างส้นเท้ากับกระดูกฝ่าเท้า",
    "color": "#95e1d3"
  },
  "cuneiform1": {
    "name": "กระดูกรูปลิ่มด้านใน (Medial Cuneiform)",
    "description": "กระดูกข้อเท้ารูปลิ่ม อยู่ด้านในของเท้า มี 2 ข้าง ใหญ่ที่สุดในกระดูกลิ่มทั้ง 3 ชิ้น เชื่อมกับนิ้วหัวแม่เท้า",
    "color": "#95e1d3"
  },
  "cuneiform2": {
    "name": "กระดูกรูปลิ่มตรงกลาง (Intermediate Cuneiform)",
    "description": "กระดูกข้อเท้ารูปลิ่ม อยู่ตรงกลาง มี 2 ข้าง เล็กที่สุดในกระดูกลิ่มทั้ง 3 ชิ้น",
    "color": "#95e1d3"
  },
  "cuneiform3": {
    "name": "กระดูกรูปลิ่มด้านนอก (Lateral Cuneiform)",
    "description": "กระดูกข้อเท้ารูปลิ่ม อยู่ด้านนอก มี 2 ข้าง อยู่ระหว่าง Intermediate cuneiform และ Cuboid",
    "color": "#95e1d3"
  },
  "metatarsal": {
    "name": "กระดูกฝ่าเท้า (Metatarsals)",
    "description": "กระดูกยาว 5 ชิ้นในฝ่าเท้าแต่ละข้าง เชื่อมระหว่างข้อเท้ากับนิ้วเท้า นับเป็น Metatarsal 1-5 จากนิ้วหัวแม่เท้าไปนิ้วก้อย ช่วยรองรับน้ำหนักและเดิน",
    "color": "#95e1d3"
  },
  "metatarsal1": {
    "name": "กระดูกฝ่าเท้าที่ 1 (First Metatarsal)",
    "description": "กระดูกฝ่าเท้าของนิ้วหัวแม่เท้า มี 2 ข้าง สั้นและหนาที่สุด รองรับน้ำหนักมากที่สุดเมื่อเดิน",
    "color": "#95e1d3"
  },
  "metatarsal2": {
    "name": "กระดูกฝ่าเท้าที่ 2 (Second Metatarsal)",
    "description": "กระดูกฝ่าเท้าของนิ้วชี้เท้า มี 2 ข้าง ยาวที่สุดในกระดูกฝ่าเท้า",
    "color": "#95e1d3"
  },
  "metatarsal3": {
    "name": "กระดูกฝ่าเท้าที่ 3 (Third Metatarsal)",
    "description": "กระดูกฝ่าเท้าของนิ้วกลางเท้า มี 2 ข้าง อยู่ตรงกลางของฝ่าเท้า",
    "color": "#95e1d3"
  },
  "metatarsal4": {
    "name": "กระดูกฝ่าเท้าที่ 4 (Fourth Metatarsal)",
    "description": "กระดูกฝ่าเท้าของนิ้วนางเท้า มี 2 ข้าง ยาวปานกลาง",
    "color": "#95e1d3"
  },
  "metatarsal5": {
    "name": "กระดูกฝ่าเท้าที่ 5 (Fifth Metatarsal)",
    "description": "กระดูกฝ่าเท้าของนิ้วก้อยเท้า มี 2 ข้าง สั้นที่สุด มีส่วนยื่นด้านข้างที่สัมผัสได้ เป็นกระดูกที่หักบ่อยจากการบาดเจ็บ",
    "color": "#95e1d3"
  },
  "toePhalanx": {
    "name": "กระดูกนิ้วเท้า (Phalanges - Foot)",
    "description": "กระดูกนิ้วเท้า แต่ละเท้ามี 14 ชิ้น นิ้วหัวแม่เท้ามี 2 ชิ้น (Proximal และ Distal) นิ้วอื่นมีอย่างละ 3 ชิ้น (Proximal, Middle, Distal) ทำให้นิ้วเท้าสามารถงอและช่วยในการทรงตัว",
    "color": "#95e1d3"
  },
  "proximalPhalanxFoot": {
    "name": "กระดูกนิ้วเท้าส่วนโคน (Proximal Phalanges - Foot)",
    "description": "กระดูกนิ้วเท้าชิ้นที่อยู่ใกล้ฝ่าเท้าที่สุด แต่ละเท้ามี 5 ชิ้น เป็นกระดูกนิ้วเท้าที่ยาวและแข็งแรงที่สุด",
    "color": "#95e1d3"
  },
  "middlePhalanxFoot": {
    "name": "กระดูกนิ้วเท้าส่วนกลาง (Middle Phalanges - Foot)",
    "description": "กระดูกนิ้วเท้าชิ้นกลาง แต่ละเท้ามี 4 ชิ้น (นิ้วหัวแม่เท้าไม่มี) สั้นกว่า Proximal phalanx",
    "color": "#95e1d3"
  },
  "distalPhalanxFoot": {
    "name": "กระดูกนิ้วเท้าส่วนปลาย (Distal Phalanges - Foot)",
    "description": "กระดูกนิ้วเท้าชิ้นปลายสุด แต่ละเท้ามี 5 ชิ้น เล็กที่สุดและรองรับเล็บเท้า",
    "color": "#95e1d3"
  },
  "sesamoids": {
    "name": "กระดูกซีซามอยด์ (Sesamoid Bones)",
    "description": "กระดูกเล็กๆ ฝังอยู่ในเอ็น พบบริเวณฝ่าเท้าใต้นิ้วหัวแม่เท้า (มี 2 ชิ้น) และบริเวณอื่นๆ ทำหน้าที่ช่วยเพิ่มแรงดึงของเอ็น ปกป้องเอ็น และกระจายแรงกดที่ข้อต่อ",
    "color": "#95e1d3"
  },
  "toe": {
    "name": "นิ้วเท้า (Toes)",
    "description": "นิ้วเท้าทั้งหมด ประกอบด้วยกระดูกนิ้วเท้า 14 ชิ้นในแต่ละเท้า ทำหน้าที่ช่วยในการทรงตัว ผลักตัวเดิน และรักษาสมดุล",
    "color": "#95e1d3"
  },
  "foot": {
    "name": "กระดูกเท้า (Foot Bones)",
    "description": "ประกอบด้วยกระดูก 26 ชิ้นในแต่ละเท้า แบ่งเป็นกระดูกข้อเท้า (Tarsals) 7 ชิ้น, กระดูกฝ่าเท้า (Metatarsals) 5 ชิ้น, และกระดูกนิ้วเท้า (Phalanges) 14 ชิ้น ทำหน้าที่รองรับน้ำหนักตัว ช่วยในการเดินและทรงตัว",
    "color": "#95e1d3"
  },
  "footLeft": {
    "name": "กระดูกเท้าซ้าย (Left Foot Bones)",
    "description": "กระดูกเท้าซ้ายทั้งหมด 26 ชิ้น ประกอบด้วยข้อเท้า ฝ่าเท้า และนิ้วเท้า ทำให้เท้าซ้ายรองรับน้ำหนักและเดินได้",
    "color": "#95e1d3"
  },
  "footRight": {
    "name": "กระดูกเท้าขวา (Right Foot Bones)",
    "description": "กระดูกเท้าขวาทั้งหมด 26 ชิ้น ประกอบด้วยข้อเท้า ฝ่าเท้า และนิ้วเท้า ทำให้เท้าขวารองรับน้ำหนักและเดินได้",
    "color": "#95e1d3"
  }
}
